Shell> dmem
Memory Address 000000007FEA2C10 78 Bytes
  7FEA2C10: 49 42 49 20 53 59 53 54-64 00 02 00 78 00 00 00  *IBI SYSTd...x...*
  7FEA2C20: 0B C6 84 D0 00 00 00 00-88 2C EA 7F 00 00 00 00  *.........,......*
  7FEA2C30: 00 10 23 20 00 00 00 00-F0 F0 EC 7D 00 00 00 00  *..# .......}....*
  7FEA2C40: 38 9E F9 7F 00 00 00 00-00 B0 ED 7D 00 00 00 00  *8..........}....*
  7FEA2C50: 48 90 9D 5D 00 00 00 00-F0 F0 EC 7D 00 00 00 00  *H..].......}....*
  7FEA2C60: 98 9E F9 7F 00 00 00 00-B8 2C EA 7F 00 00 00 00  *.........,......*
  7FEA2C70: 70 9C F9 7F 00 00 00 00-05 00 00 00 00 00 00 00  *p...............*
  7FEA2C80: 40 90 E5 7C 00 00 00 00-                         *@..|....*

Valid EFI Header at Address 000000007FEA2C10
---------------------------------------------
System: Table Structure size 00000078 revision 00020064
ConIn (000000007FF99E38) ConOut (000000005D9D9048) StdErr (000000007FF99E98)
Runtime Services 000000007FEA2CB8
Boot Services    000000007FF99C70
SAL System Table 0000000000000000
ACPI Table       0000000000000000
ACPI 2.0 Table   0000000000000000
MPS Table        0000000000000000
SMBIOS Table     000000007DED4000
Shell> pci
pci: Protocol - PciRootBridgeIo not found.
Shell> drivers
            T   D
D           Y C I
R           P F A
V  VERSION  E G G #D #C DRIVER NAME                         IMAGE NAME
== ======== = = = == == =================================== ==========
 3 FFFFFFFF ? - -  -  - <null string>                       
Shell> devices
     T   D
     Y C I
     P F A
CTRL E G G #P #D #C  Device Name
==== = = = == == === =========================================================
Shell> devtree
 Ctrl[01] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)
 Ctrl[02] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/Uart(0,0,D,D)
 Ctrl[04] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)
 Ctrl[05] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(1,GPT,5a30833f-8c43-47b1-a41d-84d40883d0c6,0x4000,0x2000)
 Ctrl[06] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(2,GPT,67ad7741-4638-47c6-a488-d396583e582a,0x6000,0x2000)
 Ctrl[07] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(3,GPT,a2d37d82-51e0-420d-83f5-470db993dd35,0x8000,0x30000)
 Ctrl[08] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(4,GPT,614e0000-0000-4b53-8000-1d28000054a9,0x38000,0x3a11fdf)
 Ctrl[09] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(5,GPT,01af895c-5cdd-ca46-babb-259ddec58a00,0x800,0x3800)
 Ctrl[0A] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)
 Ctrl[0B] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)/HD(1,GPT,449b79fa-4c90-468c-b296-0e0af2f187e2,0x800,0x4b000)
 Ctrl[0C] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)/HD(2,GPT,228556d6-5062-4d0c-b886-977c8420b1ab,0x4b800,0x101318)
Shell> dmpstore
Variable RT+BS 'EFIGlobalVariable:SignatureSupport' DataSize = 0x20
  00000000: 26 16 C4 C1 4C 50 92 40-AC A9 41 F9 36 93 43 28  *&...LP.@..A.6.C(*
  00000010: A1 59 C0 A5 E4 94 A7 4A-87 B5 AB 15 5C 2B F0 72  *.Y.....J....\+.r*
Variable RT+BS 'EFIGlobalVariable:OsIndicationsSupported' DataSize = 0x08
  00000000: 1C 00 00 00 00 00 00 00-                         *........*
Variable RT+BS 'EFIGlobalVariable:PlatformLangCodes' DataSize = 0x06
  00000000: 65 6E 2D 55 53 00                                *en-US.*
Variable RT+BS 'EFIGlobalVariable:VendorKeys' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:DeployedMode' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:AuditMode' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:SetupMode' DataSize = 0x01
  00000000: 01                                               *.*
Variable RT+BS 'EFIGlobalVariable:SecureBoot' DataSize = 0x01
  00000000: 00                                               *.*
Variable NV+RT+BS 'EFIGlobalVariable:PlatformLang' DataSize = 0x06
  00000000: 65 6E 2D 55 53 00                                *en-US.*
Shell> dh -d -v
Handle dump
01: DevicePath(7DECF0D0)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b) DevicePathToText(7FF59DC8) DevicePathUtilities(7FF59DD8) E617D64C-FE08-46DA-F4DC-BBD5870C7300(7FF99F30) UnicodeCollation2(7FF5A0D0) HIIString(7FF59F18) HIIDatabase(7FF59EC0) SimpleTextOut(7FF99E98)   Address: 7FF99E98 Attrib 07
     mode 0: Col 80 Row 25
     mode 1: Col -1 Row -1
  *  mode 2: Col 140 Row 34 SimpleTextIn(7FF99E38) SimpleTextInEx(7FF99E50) Rng(7FF5A0C0) 
02: DevicePath(7CE83040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/Uart(0,0,D,D) 
03: DriverBinding(7DECF430) 
   Driver Name [03]   : <Unknown>
   Driver Image Name  : <Unknown>
   Driver Version     : FFFFFFFF
   Driver Type        : <Unknown>
   Configuration      : NO
   Diagnostics        : NO
   Managing           : None
04: DevicePath(7CE80040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2) BlockIO(7DED0730)   Removable MId:1 bsize 200, lblock 3A49FFF (31,293,702,144), raw rw !cached 
05: DevicePath(7CE7D040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(1,GPT,5a30833f-8c43-47b1-a41d-84d40883d0c6,0x4000,0x2000) BlockIO(7DED08A0)   Removable MId:1 bsize 200, lblock 1FFF (4,194,304), partition rw !cached 
06: DevicePath(7CE7B040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(2,GPT,67ad7741-4638-47c6-a488-d396583e582a,0x6000,0x2000) BlockIO(7DED0C60)   Removable MId:1 bsize 200, lblock 1FFF (4,194,304), partition rw !cached 
07: DevicePath(7CE79040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(3,GPT,a2d37d82-51e0-420d-83f5-470db993dd35,0x8000,0x30000) BlockIO(7DED14C0)   Removable MId:1 bsize 200, lblock 2FFFF (100,663,296), partition rw !cached SimpleFileSystem(7DED1860) 
08: DevicePath(7CE77040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(4,GPT,614e0000-0000-4b53-8000-1d28000054a9,0x38000,0x3a11fdf) BlockIO(7DED1D40)   Removable MId:1 bsize 200, lblock 3A11FDE (31,176,244,736), partition rw !cached SimpleFileSystem(7DED20A0) 
09: DevicePath(7CE75040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/eMMC(0)/eMMC(2)/HD(5,GPT,01af895c-5cdd-ca46-babb-259ddec58a00,0x800,0x3800) BlockIO(7DED2A00)   Removable MId:1 bsize 200, lblock 37FF (7,340,032), partition rw !cached EFISystemPartition(0) SimpleFileSystem(7DED2DA0) 
0A: DevicePath(7CE74040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0) BlockIO(7DED5EB0)   Removable MId:1 bsize 200, lblock 1DACBFF (15,931,539,456), raw rw !cached 
0B: DevicePath(7CE71040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)/HD(1,GPT,449b79fa-4c90-468c-b296-0e0af2f187e2,0x800,0x4b000) BlockIO(7DED6020)   Removable MId:1 bsize 200, lblock 4AFFF (157,286,400), partition rw !cached EFISystemPartition(0) SimpleFileSystem(7DED63C0) 
0C: DevicePath(7CE6F040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)/HD(2,GPT,228556d6-5062-4d0c-b886-977c8420b1ab,0x4b800,0x101318) BlockIO(7DED6490)   Removable MId:1 bsize 200, lblock 101317 (539,373,568), partition rw !cached SimpleFileSystem(7DED7130) 
0D: FirmwareManagement(7FF59E90) 
0E: ImageDevicePath(7CE37040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)/HD(1,GPT,449b79fa-4c90-468c-b296-0e0af2f187e2,0x800,0x4b000)/efi\boot\bootaa64.efi LoadedImage(7DEDA8F0)   Revision......: 0x00001000
  ParentHandle..: 7DECF0F0
  SystemTable...: 7FEA2C10
  DeviceHandle..: 7DED5FF0
  FilePath......: /efi\boot\bootaa64.efi
  PdbFileName...: <null string>
  OptionsSize...: 0
  LoadOptions...: 0
  ImageBase.....: 7CD5A000
  ImageSize.....: DD000
  CodeType......: EfiLoaderCode
  DataType......: EfiLoaderData
  Unload........: 0 
0F: ImageDevicePath(7CD57040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b,0000000000000000)/SD(1)/SD(0)/HD(1,GPT,449b79fa-4c90-468c-b296-0e0af2f187e2,0x800,0x4b000)/\EFI\BOOT/Shell.efi LoadedImage(7DEDAF90)   Revision......: 0x00001000
  ParentHandle..: 7DEDA960
  SystemTable...: 7FEA2C10
  DeviceHandle..: 7DED5FF0
  FilePath......: /\EFI\BOOT/Shell.efi
  PdbFileName...: <null string>
  OptionsSize...: 0
  LoadOptions...: 0
  ImageBase.....: 5D8CB000
  ImageSize.....: D9000
  CodeType......: EfiLoaderCode
  DataType......: EfiLoaderData
  Unload........: 0 SimpleTextOut(5D9D9048)   Address: 5D9D9048 Attrib 07
     mode 0: Col 80 Row 25
     mode 1: Col -1 Row -1
  *  mode 2: Col 140 Row 34 ShellParameters(5D9C2040) Shell(5D98F5C0) 
Shell> memmap
Type       Start            End              # Pages          Attributes
Available  0000000000200000-000000005D859FFF 000000000005D65A 0000000000000008
BS_Data    000000005D85A000-000000005D8CAFFF 0000000000000071 0000000000000008
LoaderCode 000000005D8CB000-000000005D9A3FFF 00000000000000D9 0000000000000008
BS_Data    000000005D9A4000-000000005DA7DFFF 00000000000000DA 0000000000000008
LoaderData 000000005DA7E000-000000005DA7EFFF 0000000000000001 0000000000000008
LoaderCode 000000005DA7F000-000000007CD52FFF 000000000001F2D4 0000000000000008
BS_Data    000000007CD53000-000000007CD59FFF 0000000000000007 0000000000000008
LoaderCode 000000007CD5A000-000000007CE36FFF 00000000000000DD 0000000000000008
BS_Data    000000007CE37000-000000007CE39FFF 0000000000000003 0000000000000008
ACPI_Recl  000000007CE3A000-000000007CE52FFF 0000000000000019 0000000000000008
BS_Data    000000007CE53000-000000007CE54FFF 0000000000000002 0000000000000008
RT_Data    000000007CE55000-000000007CE55FFF 0000000000000001 8000000000000008
BS_Data    000000007CE56000-000000007CE58FFF 0000000000000003 0000000000000008
RT_Data    000000007CE59000-000000007CE6AFFF 0000000000000012 8000000000000008
BS_Data    000000007CE6B000-000000007CE83FFF 0000000000000019 0000000000000008
BS_Code    000000007CE84000-000000007DED3FFF 0000000000001050 0000000000000008
RT_Data    000000007DED4000-000000007DED4FFF 0000000000000001 8000000000000008
BS_Code    000000007DED5000-000000007FE9FFFF 0000000000001FCB 0000000000000008
RT_Code    000000007FEA0000-000000007FEAFFFF 0000000000000010 8000000000000008
BS_Code    000000007FEB0000-000000007FFFFFFF 0000000000000150 0000000000000008
 
  Reserved  :              0 Pages (0 Bytes)
  LoaderCode:        128,138 Pages (524,853,248 Bytes)
  LoaderData:              1 Pages (4,096 Bytes)
  BS_Code   :         12,651 Pages (51,818,496 Bytes)
  BS_Data   :            371 Pages (1,519,616 Bytes)
  RT_Code   :             16 Pages (65,536 Bytes)
  RT_Data   :             20 Pages (81,920 Bytes)
  ACPI_Recl :             25 Pages (102,400 Bytes)
  ACPI_NVS  :              0 Pages (0 Bytes)
  MMIO      :              0 Pages (0 Bytes)
  MMIO_Port :              0 Pages (0 Bytes)
  PalCode   :              0 Pages (0 Bytes)
  Unaccepted:              0 Pages (0 Bytes)
  Available :        382,554 Pages (1,566,941,184 Bytes)
  Persistent:              0 Pages (0 Bytes)
              -------------- 
Total Memory:          2,046 MB (2,145,386,496 Bytes)
Shell> smbiosview
SMBIOS Entry Point Structure:
Anchor String:        _SM_
EPS Checksum:         0x3B
Entry Point Len:      31
Version:              3.0
Number of Structures: 7
Max Struct size:      69
Table Address:        0x7DED4020
Table Length:         283
Entry Point revision: 0x0
SMBIOS BCD Revision:  0x0
Inter Anchor:         _DMI_
Inter Checksum:       0x7B
Formatted Area:  
  00000000: 00 00 00 00 00                                   *.....*

=========================================================
Query Structure, conditions are:
QueryType   = Random 
QueryHandle = Random
ShowType    = SHOW_DETAIL


=========================================================
Type=0, Handle=0x0
Dump Structure as:
Index=0,Length=0x45,Addr=0x7DED4020
00000000: 00 18 00 00 01 02 00 00-03 00 80 08 01 00 00 00  *................*
00000010: 00 00 00 0C 17 0A FF FF-55 2D 42 6F 6F 74 00 32  *........U-Boot.2*
00000020: 30 32 33 2E 31 30 2D 67-31 36 36 63 34 30 38 39  *023.10-g166c4089*
00000030: 62 62 2D 64 69 72 74 79-00 31 30 2F 30 31 2F 32  *bb-dirty.10/01/2*
00000040: 30 32 33 00 00                                   *023..*
Structure Type: BIOS Information
Format part Len : 24
Structure Handle: 0
Vendor: U-Boot
BiosVersion: 2023.10-g166c4089bb-dirty
BiosSegment: 0x0
BiosReleaseDate: 10/01/2023
BiosSize:  64 KB
BIOS Characteristics: 
PCI is supported
BIOS is Upgradeable(FLASH)
Selectable Boot is supported
 Bits 32:47 are reserved for BIOS Vendor
 Bits 48:64 are reserved for System Vendor
BIOS Characteristics Extension Byte1:
BIOS Characteristics Extension Byte2:
Enable Targeted Content Distribution
UEFI Specification is supported
 Bits 5:7 are reserved for future assignment
SystemBiosMajorRelease: 23
SystemBiosMinorRelease: 10
EmbeddedControllerFirmwareMajorRelease: 255
EmbeddedControllerFirmwareMinorRelease: 255


=========================================================
Type=1, Handle=0x1
Dump Structure as:
Index=1,Length=0x45,Addr=0x7DED4065
00000000: 01 1B 01 00 01 02 00 03-34 32 36 30 37 36 34 35  *........42607645*
00000010: 38 32 65 37 61 61 65 65-00 00 00 55 6E 6B 6E 6F  *82e7aaee...Unkno*
00000020: 77 6E 00 55 6E 6B 6E 6F-77 6E 20 50 72 6F 64 75  *wn.Unknown Produ*
00000030: 63 74 00 34 32 36 30 37-36 34 35 38 32 65 37 61  *ct.4260764582e7a*
00000040: 61 65 65 00 00                                   *aee..*
Structure Type: System Information
Format part Len : 27
Structure Handle: 1
Manufacturer: Unknown
ProductName: Unknown Product
Version: 
SerialNumber: 4260764582e7aaee
Dump Uuid
size=16:
00000000: 34 32 36 30 37 36 34 35-38 32 65 37 61 61 65 65  *4260764582e7aaee*
System Wakeup Type: Reserved
SKUNumber: 
Family: 


=========================================================
Type=2, Handle=0x2
Dump Structure as:
Index=2,Length=0x27,Addr=0x7DED40AA
00000000: 02 0E 02 00 01 02 00 00-00 01 00 00 00 0A 55 6E  *..............Un*
00000010: 6B 6E 6F 77 6E 00 55 6E-6B 6E 6F 77 6E 20 50 72  *known.Unknown Pr*
00000020: 6F 64 75 63 74 00 00                             *oduct..*
Structure Type: Base Board Information
Format part Len : 14
Structure Handle: 2
Manufacturer: Unknown
ProductName: Unknown Product
Version: 
SerialNumber: 
AssetTag: 
Base Board Feature Flags: Hosting board
LocationInChassis: 
ChassisHandle: 0x0
Base Board Board Type: Motherboard


=========================================================
Type=3, Handle=0x3
Dump Structure as:
Index=3,Length=0x1E,Addr=0x7DED40D1
00000000: 03 15 03 00 01 03 00 00-00 03 03 03 03 00 00 00  *................*
00000010: 00 00 00 00 00 55 6E 6B-6E 6F 77 6E 00 00        *.....Unknown..*
Structure Type: System Enclosure
Format part Len : 21
Structure Handle: 3
Manufacturer: Unknown
Type: 3
System Enclosure or Chassis Types:  Desktop
Version: 
SerialNumber: 
AssetTag: 
Bootup state System Enclosure or Chassis Status:  Safe
Power Supply State System Enclosure or Chassis Status:  Safe
Thermal state System Enclosure or Chassis Status:  Safe
Security Status System Enclosure or Chassis Security Status:  None
Dump OemDefined
size=4:
00000000: 00 00 00 00                                      *....*
Height: 0
NumberofPowerCords: 0
ContainedElementCount: 0
ContainedElementRecordLength: 0


=========================================================
Type=4, Handle=0x4
Dump Structure as:
Index=4,Length=0x39,Addr=0x7DED40EF
00000000: 04 30 04 00 00 03 02 01-00 00 00 00 00 00 00 00  *.0..............*
00000010: 01 00 00 00 00 00 00 00-01 06 FF FF FF FF FF FF  *................*
00000020: 00 00 00 00 00 00 00 00-02 00 00 00 00 00 00 00  *................*
00000030: 55 6E 6B 6E 6F 77 6E 00-00                       *Unknown..*
Structure Type: Processor Information
Format part Len : 48
Structure Handle: 4
SocketDesignation: 
Processor Type:  Central Processor
Processor Family: Unknown
ProcessorManufacturer: Unknown
Dump ProcessorId
size=8:
00000000: 00 00 00 00 00 00 00 00-                         *........*
ProcessorVersion: Unknown
Processor Information -  Voltage:
ExternalClock: 0
MaxSpeed: 0
CurrentSpeed: 0
Processor Status:
CPU Socket Unpopulated
CPU Enabled
Processor Upgrade: None
L1CacheHandle: 0xFFFF
L2CacheHandle: 0xFFFF
L3CacheHandle: 0xFFFF
SerialNumber: 
AssetTag: 
PartNumber: 
CoreCount: 0
EnabledCoreCount: 0
ThreadCount: 0
Processor Characteristics: No Info
CoreCount2: 0
EnabledCoreCount2: 0
ThreadCount2: 0


=========================================================
Type=32, Handle=0x5
Dump Structure as:
Index=5,Length=0xD,Addr=0x7DED4128
00000000: 20 0B 05 00 00 00 00 00-00 00 00 00 00           * ............*
Structure Type: System Boot Information 
Format part Len : 11
Structure Handle: 5
Dump Reserved
size=6:
00000000: 00 00 00 00 00 00                                *......*
System Boot Status:  No errors detected

=========================================================
Type=127, Handle=0x6
Dump Structure as:
Index=6,Length=0x6,Addr=0x7DED4135
00000000: 7F 04 06 00 00 00                                *......*
Structure Type: End-of-Table 
Format part Len : 4
Structure Handle: 6
This structure indicates the End-of-table!


=========================================================
Shell> 
